[
    {
        "ratings": {
            "5 star": "64%",
            "4 star": "17%",
            "3 star": "5%",
            "2 star": "4%",
            "1 star": "10%"
        },
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "I love this Samsung J7. I couldn't afford the sticker price for the S6 or S7 (sticker shock!). Therefore; I opted for this which is scaled down in terms of processing/memory BUT it's much better quality than the phone I was using for my Boost Mobile account. I had no issues charging it or switching it over from old phone to this new phone - via my online account (I didn't have to talk to anybody to do this and it worked out just great). My hubby has the Samsung S6 which he saved/paid for upfront (no contract at Boost Mobile). Comparing my new J7 to his S6 - well; apples to oranges. His has 2 processors (a quad-core and an octa-core). This J7 has just the octa-core BUT for me is proving to be plenty of processing power along with the 2GB ROM. This was pretty comparable to the ZTE Warp Elite I've been using since January 2016 but I'd have to say that the Samsung is much faster - also that the screen response is so much better in this J7 model (even with the glass protection I placed on the screen). My hubby bought me this for my upcoming 60th birthday! GREAT present for me.....all mine! Thank you 'shopcelldeals' for selling this at a reasonable price that was affordable. Recommended.",
                "review_posted_date": "06 May 2016",
                "review_header": "GORGEOUS phone .... I'm in love with it!",
                "review_rating": "5.0 ",
                "review_author": "Colleen Marie",
                "review_author_link": [
                    "/gp/profile/amzn1.account.AFFVIBLMBQBE6VWNTEOSDXJOTSVA/ref=cm_cr_dp_d_gw_tr?ie=UTF8"
                ]
            },
            {
                "review_comment_count": "",
                "review_text": "I love this phone! Coming from the galaxy S3 for Boost this is a big jump in the right direction. $20 cheaper on amazon than the boost mobile site another plus.The battery last all day. That is while talking/texting using apps. It is two times bigger than the S3 but def worth it. The operating system is much faster and more responsive as well.",
                "review_posted_date": "19 Nov 2016",
                "review_header": "Worth it.",
                "review_rating": "5.0 ",
                "review_author": "TG",
                "review_author_link": [
                    "/gp/profile/amzn1.account.AEDTSQZY4QMTFKPKP5LTDIV5AGCQ/ref=cm_cr_dp_d_gw_tr?ie=UTF8"
                ]
            },
            {
                "review_comment_count": "",
                "review_text": "My wife and I updated our phones to the SAMSUNG GALAXY J-7. We enjoyed them SO MUCH, I purchased another set for us as back-up. The picture quality is EXCELLANT. !!!!!",
                "review_posted_date": "07 Mar 2017",
                "review_header": "We enjoyed them SO MUCH",
                "review_rating": "5.0 ",
                "review_author": "K.D.G.",
                "review_author_link": [
                    "/gp/profile/amzn1.account.AHCV5HCWYSVIZA77OTEPR4OAD2JA/ref=cm_cr_dp_d_gw_tr?ie=UTF8"
                ]
            },
            {
                "review_comment_count": "",
                "review_text": "This phone is SO much better than the Galaxy S3 I had prior. Better memory (by far); Better battery life (by far!!); Better view (bigger screen); If you're looking for an affordable and pretty high-performing smart phone, this could be just what you're looking for. S3 = junk; J7 = superb, really... Two thumbs up for this one, for sure!",
                "review_posted_date": "20 Mar 2017",
                "review_header": "This phone is SO much better than the Galaxy S3 I had prior",
                "review_rating": "5.0 ",
                "review_author": "Boru in Illinois",
                "review_author_link": [
                    "/gp/profile/amzn1.account.AH4MJHGNADEZWHS6T2NPQXPUYBUA/ref=cm_cr_dp_d_gw_tr?ie=UTF8"
                ]
            },
            {
                "review_comment_count": "",
                "review_text": "Love...love..love this phone....phone great...battey is great..$50 cheaper than boost mobile website....nice size... I had a Samsung J3 for a month couldnt take it....that phone was slow...camera was horrible....so so glad i made the switch..",
                "review_posted_date": "04 Feb 2017",
                "review_header": "Happy camper!!",
                "review_rating": "5.0 ",
                "review_author": "Fancy Faye",
                "review_author_link": [
                    "/gp/profile/amzn1.account.AHAFUIOJLFADFCUVPGV4VER2GSOA/ref=cm_cr_dp_d_gw_tr?ie=UTF8"
                ]
            },
            {
                "review_comment_count": "",
                "review_text": "I've had this phone for a year and 2 months now. So far so good. I think the camera functions are good, that mattered most to me. And the interface works well, if you are familiar with the Droid. It is a larger size phone which takes some adjustment! Occasionally it overheats but I have a cooling app. Also when the battery gets low to 15%, it goes down to 0 pretty fast. There is bloatware which was expected.. But otherwise I'm happy so far!",
                "review_posted_date": "13 Aug 2018",
                "review_header": "Good phone for price",
                "review_rating": "4.0 ",
                "review_author": "Emily Elizabeth",
                "review_author_link": [
                    "/gp/profile/amzn1.account.AHJNO5LGAPIQTFYSIRKUYSN3BIOQ/ref=cm_cr_dp_d_gw_tr?ie=UTF8"
                ]
            },
            {
                "review_comment_count": "",
                "review_text": "By far one of the best Samsung phones they have made!! I broke mine and searched high and low trying to find a replacement locally but I was unable to find one. I now have an iPhone (which i Love) but if I ever got another Samsung I would definitely try getting this phone again.",
                "review_posted_date": "14 Aug 2018",
                "review_header": "Great phone and Camera for a fair price!",
                "review_rating": "5.0 ",
                "review_author": "Brittany M.",
                "review_author_link": [
                    "/gp/profile/amzn1.account.AG65TUETPZMTTXOMXF3XM6UKFFQA/ref=cm_cr_dp_d_gw_tr?ie=UTF8"
                ]
            },
            {
                "review_comment_count": "",
                "review_text": "Great phone. Very comparable to the s6 but processing speeds are a little lower and the internal memory is short. But for the price i will not complain. 4 stars just because I'm a bit disappointed with the cameras. But it has flash on selfie mode, that's cool",
                "review_posted_date": "01 Apr 2017",
                "review_header": "Great phone. Very comparable to the s6 but processing ...",
                "review_rating": "4.0 ",
                "review_author": "RaiderRush",
                "review_author_link": [
                    "/gp/profile/amzn1.account.AGO2WNEM5TCD6DWBTGF4Z5UE7YTQ/ref=cm_cr_dp_d_gw_tr?ie=UTF8"
                ]
            }
        ],
        "url": "http://www.amazon.com/dp/B01ETPUQ6E",
        "name": "Samsung Galaxy J7 - No Contract Phone - White - (Boost Mobile)(Carrier locked phone )",
        "price": ""
    },
    {
        "ratings": {
            "5 star": "35%",
            "4 star": "19%",
            "3 star": "9%",
            "2 star": "16%",
            "1 star": "21%"
        },
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "I've had some time to kick my phone around (figuratively and literally), and I'm really impressed with this phone. It's value priced, but still very functional. I switched from a Samsung Galaxy SIII, and I feel that this was definitely an upgrade. While the Moto G3 has less memory (8GB) and storage (both internally, and it only supports up to 32GB SDHC micro card), the better processor makes a huge difference. I don't play games, but I do still run a fair number of productivity apps (the biggest being Polaris Office and TeamViewer) and they benefit greatly from the quad-core 1.4 GHz Cortex-A53 CPUs performance. The SIII would always hang up when running bigger applications, and would always freeze up when pulling up the SwiftKey keyboard. Some apps were almost unusable on the SIII because of these stutters and freezing (ProCapture was the biggest problem). I'm really impressed at how good the camera sensor is. The color, contrast, and brightness of the screen are also incredible. I've had better luck with 4G data, though I do notice a little less speed on Wifi after losing 5 gHz connectivity. The audio on the phone is an improvement, with the two larger speakers on the front of the device. Call clarity has been about as good as the SIII, in my tests. The phone construction is very solid, and seems very rugged in general. I was very happy with the upgrade, from the Galaxy SIII. For my purposes, it's a great phone. I like that it's water resistant, and it performs very well. My girlfriend ended up upgrading to the same phone, from an HTC Desire 816, and she's very happy with the performance boost. It's definitely NOT a flagship phone, and it's only suitable for lower-end or older games. This is not a power user phone, by any means. The smaller storage is probably the biggest limitation. While it hasn't greatly affected me, as I only have a few big apps, but it's definitely the most profound limitation of the phone. If you don't need the power and space of a flagship phone, but still want a very high-quality all-weather handset, I think this is an excellent option. The price jumps around, so if you wait around for a small discount, this is probably one of the better deals on the current phone market. It suits my needs very well, and - having survived being caught in a few big downpours - has been worth every penny. Sept. 2016 Update: For a few weeks, I was having problems with the SD Micro card becoming unmounted, or write problems on the SD Micro card. I assumed it was loosening up in the case (a problem I had with an older phone). Eventually it would refuse to re-mount, despite all attempts. It turned out the phone was having specific problems with the Samsung 32GB EVO Plus Class 10 Micro SDHC, that several other Moto G3 users experienced. I replaced it with a Class 6 Kingston card, and it's been working flawlessly ever since, without any noticeable decrease in read/write speeds.",
                "review_posted_date": "01 Aug 2016",
                "review_header": "Excellent Phone For Value-Conscious Buyers & Intermediate Users - Rugged Weatherproof Design",
                "review_rating": "5.0 ",
                "review_author": "Mr. Staack",
                "review_author_link": [
                    "/gp/profile/amzn1.account.AH33K4VDG5O6SIJSWFI73XGYVFHQ/ref=cm_cr_dp_d_gw_tr?ie=UTF8"
                ]
            },
            {
                "review_comment_count": "",
                "review_text": "This phone is one of the best I have had from Virgin Mobile, and know it would be better with T-Mobile or another GSM carrier with the extra specs those add. The camera is very nice for such a cheap phone, 13mp in the back, 5mp in the front. Works well in relatively low lighting and doesn't begin to look grainy until it's obviously much too dark, such as outside in the night with a fire for just light like the stone ages. Anyway, it's not the best camera, but definitely better than the LG Volt and LG G Stylo I had had before this one. The screen isn't brilliantly bright and crisp, but I promise it doesn't look horribly. The screen is big, but not too big, more comfortable than the LG G Stylo in my personal opinion, but if you like \"Phablets\", this is a big small, but you'd probably get used to it. The ram is only 1gb in the Virgin Mobile edition, and only 4.5gb of internal storage available to the user, even though it advertises 8gb. The other phone with the GSM carriers have 2gb of ram, and 16gb or storage with only 10gb or so left for the users accessibility. It comes with Lollipop, although I am sure the Marshmellow update wouldn't be long to hit considering it did hit the LG G Stylo quickly, and this phone is the 2015 successor of the Moto G lineups. The phone is able to be rooted, although I do not advise for it will void your warranty with Motorola and possibly Virgin Mobile, so you should know what you are doing. However, this should be brought up because Virgin Mobile carries a variety of cheap phones, but they are mostly LG. LG should not be rooted because they end up killing over and are touchy. Motorola is more laid back, and it should be noted so people know what they should and shouldn't if they are not experienced and want to try new things. Yes, this phone is water resistant, but not water proof. You can not swim with it and epect to use it under water. This is purely for accidents only. You can use this near water and if something splashes on it, it will be fine. You must remember to seal the back near the camera and the edges, or it will completely useless and you will lose your phone to water damage. The biggest con is the bit of crashes I have experienced on such little use. The play store crashes immediately when trying to type, and many other things end up crashing. This may not be a problem to all, but to me it was and should be noted. This does have an LED to those who care about that little helpful feature, however it is not able to be used for anything other than battery purposes, so you don't get anything very helpful from it. There is the feature Moto Display which shows your notifications on the screen in a specific way and there are settings for you to mess with. Over all this phone is a very great phone for the price and something that people can greatly appreciate for a low budget.",
                "review_posted_date": "25 Apr 2016",
                "review_header": "Very good for Virgin Mobile.",
                "review_rating": "5.0 ",
                "review_author": "Veronica Hale",
                "review_author_link": [
                    "/gp/profile/amzn1.account.AEKYCIXJZI2B2BHH2KXAQI3ZQVIA/ref=cm_cr_dp_d_gw_tr?ie=UTF8"
                ]
            },
            {
                "review_comment_count": "",
                "review_text": "This phone is the best virgin mobile phone I have had by far.. I paid only $54.00 for it refurbished on Amazon. Let me start by saying I have tried many. It got to the point where I was so sick of buying hundred plus dollar phones that would crap out by 6 months glitching, memory problems, data problems, etcetera. I've tried all of the LGs they are okay but very hit-and-miss. My last LG experience with a LG Stylo which I thought was going to be a great phone until it would randomly, not receive text messages from important people. I had read about that in many of the reviews on that phone so I took a chance and to my surprise it happened to me too. It may not sound like a huge deal to some but it can really leave you in a predicament. That was the last straw. I have only had this phone a couple of months but so far I have not been disappointed. Aesthetically it's nothing fancy. But the camera is really nice phone, calls are really decent and browsing the web and multiple apps very fast. this is a nice size phone not too big like the stylo not too small at all. This is very colorful compared to any of the LG's I've ever had. Way better then the HTC phones I've owned as well. This phone is an excellent deal and the best Bang for your buck.",
                "review_posted_date": "09 Jul 2016",
                "review_header": "Best budget phone hands down!",
                "review_rating": "5.0 ",
                "review_author": "DM",
                "review_author_link": [
                    "/gp/profile/amzn1.account.AHC2NTRMCHIPUWSSL5Z7V2V3GP7A/ref=cm_cr_dp_d_gw_tr?ie=UTF8"
                ]
            }
        ],
        "url": "http://www.amazon.com/dp/B017HW9DEW",
        "name": "Motorola Moto G (3rd Generation) No Contract Phone (Virgin Mobile) - Retail Packaging",
        "price": "$199.95"
    },
    {
        "ratings": {
            "5 star": "43%",
            "4 star": "43%",
            "1 star": "14%"
        },
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "I gave it a try even after I saw the review about its crashing computer because I thought maybe they had updated the driver since. That and I prefer the compact version. NOPE, they have NOT. The screen would froze. It requires computer reboot before it's operational again. When I got the blue screen, I knew it's time to return the product. Right now, I'm waiting for Amazon to tell me why I'm being charged \"Return Shipping Fee Refund Deduction: ($14.35)\" for return a defective unit. Wish me luck.",
                "review_posted_date": "29 Mar 2017",
                "review_header": "Freezes screen and gives blue of death.",
                "review_rating": "1.0 ",
                "review_author": "iSpendMoney33713",
                "review_author_link": [
                    "/gp/profile/amzn1.account.AEOPFTWA4AXWIUIARGG23HAO5R2A/ref=cm_cr_dp_d_gw_tr?ie=UTF8"
                ]
            },
            {
                "review_comment_count": "",
                "review_text": "This was exactly what I needed! No more lost connections!",
                "review_posted_date": "09 Apr 2018",
                "review_header": "Five Stars",
                "review_rating": "5.0 ",
                "review_author": "Jennifer",
                "review_author_link": [
                    "/gp/profile/amzn1.account.AEGWBOBLPTQBDIVUYJ6AK2VI4ETQ/ref=cm_cr_dp_d_gw_tr?ie=UTF8"
                ]
            },
            {
                "review_comment_count": "",
                "review_text": "Easy install works great on win 10system",
                "review_posted_date": "26 Jul 2017",
                "review_header": "Four Stars",
                "review_rating": "4.0 ",
                "review_author": "Bill Marshall",
                "review_author_link": [
                    "/gp/profile/amzn1.account.AHQSUO5KUXZHTH5HWLZXU6PHZT5A/ref=cm_cr_dp_d_gw_tr?ie=UTF8"
                ]
            },
            {
                "review_comment_count": "",
                "review_text": "Crap!! This thing fried the boot files on my computer and now I can't even get to a point where I can do a factory reset.",
                "review_posted_date": "06 Dec 2015",
                "review_header": "Garbage, don't waste your time.",
                "review_rating": "1.0 ",
                "review_author": "Bryan Decker",
                "review_author_link": [
                    "/gp/profile/amzn1.account.AFL6K2EMVTZ3X64RKCLKLW6Q5TOQ/ref=cm_cr_dp_d_gw_tr?ie=UTF8"
                ]
            },
            {
                "review_comment_count": "",
                "review_text": "If you have a free VGA input on your monitor, and a laptop that doesn't have a VGA output, this device bridges the gap between them, and allows you to use your monitor with your laptop. I connected mine with Windows 8.1 to a 1920 x 1080 monitor. You have the usual screen options, you can mirror the screen, extend the displays, or use the external or internal monitor as the only one. With Windows 8.1 you can quickly get to this menu through the Charms, then \"Project\" (verb). The software needed lives on the actual StarTech cable. When you first connect it to your PC, it recognizes it as a USB drive, around 8MB occupied by the EXE file that has the software. Depending on how your Auto Play settings (default or otherwise) are setup, you may have to manually run this file. This installs the necessary software and then requests a reboot to complete the installation. Once rebooted, you can go to the Windows menus and customize it. If your laptop is 1366 x 768, you will only get 1366 x 768 on your external monitor if you mirror. If you select Extend or Second Display Only, you will get the full resolution of the screen (1920 x 1080 in my case). The maximum it can support is 1920 x 1200 but I don't have that resolution to test it. It comes in a cardboard box, with the device and a postcard size Quick Install Guide with small print.",
                "review_posted_date": "27 Oct 2016",
                "review_header": "Good way to bridge the gap between a free Monitor VGA input and a Laptop without VGA output",
                "review_rating": "4.0 ",
                "review_author": "bsg2004",
                "review_author_link": [
                    "/gp/profile/amzn1.account.AE4CQXRSGUXWPSONX3OE7DMXILKA/ref=cm_cr_dp_d_gw_tr?ie=UTF8"
                ]
            },
            {
                "review_comment_count": "",
                "review_text": "The StarTech.com USB 3.0 to VGA Video Adapter On-Board Drivers for Installation without Internet Connection or CD-ROM Drive worked well for me. But I was analyzing, if you could call it that, who this benefits or who this benefits more. The StarTech.com USB 3.0 to VGA Video works simple enough but it has USB 3.0. How many computers with USB 3.0 would not have support for 2 monitors? I don't know. Then I looked at its ability to output over USB 2.0 and that's where the greater benefit comes from. So it is good the StarTech.com USB 3.0 to VGA Video features built in support for USB 3.0 allowing resolutions up to 1920x1200 but if you only have 2.0 you'll get a usable 800x600 at 60Hz. If anything, even if you had a video subsystem that gave you another display option, the StarTech.com USB 3.0 to VGA Video would allow you to offload the processing to it, merely sacrificing a USB 3.0 port and giving you full video rendering power on your main display rather than siphoning off some of that power for the auxiliary display. Works great and complements systems with less powerful hardware. Uses Fresco - FL2000DX chipset, has 512MB DDR II, and supports Widescreen(16/32 bit): 1920x1200, 1920x1080, 1680x1050, 1600x900, 1440x900, 1360x768, 1280x800, 1280x768, 1280x720 AND Standard(16/32 bit): 1600x1200, 1400x1050, 1280x1024, 1280x960, 1152x864, 1024x768, 800x600 Also features a StarTech 2 year warranty",
                "review_posted_date": "10 Oct 2016",
                "review_header": "Works great...",
                "review_rating": "5.0 ",
                "review_author": "Atomic Tofu",
                "review_author_link": [
                    "/gp/profile/amzn1.account.AHPNEEABM5OSDMOU67FIV5767RUQ/ref=cm_cr_dp_d_gw_tr?ie=UTF8"
                ]
            },
            {
                "review_comment_count": "",
                "review_text": "It's a possible vision of gadgets to come - either around USB or Thunderbolt or its successors. Instead of shipping a CD/DVD install disk, the software is integrated into the device. This could become a new design pattern in which versioning and manufacturing for software-enabled devices incorporate the drivers onboard. So, a neat idea. The driver in installed on this device was auto-detected on one of my HP HPE-480t Windows 7 desktops. It will prompt you for installation activities. But it was not auto-detected on my HP Spectre running Windows 10 Pro. (I have seen USB device related issues with Windows 10 as of this post, so it's hard to know where to point fingers). In this case, you'll see the device in the Printers and Devices section, but it will not show as a removable drive like a USB storage stick. You can try the Windows device troubleshooter (Windows knows the driver is missing or bad) and tell it to download a driver, but that didn't work for me even after a reboot. Solution: Go to the Startech website and unzip the driver. There's a setup.exe for you to run, a la early 90's. That worked. Yes, USB is a CPU cycle-stealing protocol -- yes, I was all in for Firewire. So an older machine can be a problem, and you need a USB3.x port. Using a hub might be a problem; though it worked on the Win7 desktop, I didn't try it on the laptop as that would have confused matters. Warranty is 2 years. Make sure you have an antivirus scanner active to check the driver when it's installed. Since the monitor you use will have varying resolution, you will probably have more adjusting to do after it's installed, or just accept some black space around the image. Disclaimer from the manufacturer: \"This USB video adapter uses a Fresco family chipset. If you’re connecting this device to a computer along with additional USB video adapters or docking stations, please avoid using devices with a DisplayLink or Trigger family chipset.\" I am glad to have this in my laptop toolbox, and for some people it will save one of the possible needs for a more costly docking station. Once installed, the main issue for laptop use is to see if you're willing to carry along a VGA cable to pair with a monitor. (It's increasingly an HDMI world out there, so watch the shifting standards).",
                "review_posted_date": "01 Oct 2016",
                "review_header": "Don't Need no Dual-Monitor Docking Station - Get This Working Before the Standards Change Again",
                "review_rating": "4.0 ",
                "review_author": "Knowlengr",
                "review_author_link": [
                    "/gp/profile/amzn1.account.AGPY4HXLQIFSSXJ4EH6EZZFFEXTA/ref=cm_cr_dp_d_gw_tr?ie=UTF8"
                ]
            }
        ],
        "url": "http://www.amazon.com/dp/B00U8KSIOM",
        "name": "StarTech.com USB 3.0 to VGA Video Adapter - On-Board Drivers for Installation Without an Internet Connection or CD-ROM Drive - 1920x1200",
        "price": "$52.99"
    }
]